MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/include/proc/p32mx320f064h.h
extern volatile ___DDPSTATbits_t _DDPSTATbits __asm__ ("_DDPSTAT") __attribute__((section("sfrs"), address(0xBF880140)));
#define _STRO _STRO
extern volatile uint32_t   _STRO __attribute__((section("sfrs"), address(0xBF880170)));
extern volatile uint32_t        _STROCLR __attribute__((section("sfrs"),address(0xBF880174)));
extern volatile uint32_t        _STROSET __attribute__((section("sfrs"),address(0xBF880178)));
extern volatile uint32_t        _STROINV __attribute__((section("sfrs"),address(0xBF88017C)));
#define _APPO _APPO
extern volatile uint32_t   _APPO __attribute__((section("sfrs"), address(0xBF880180)));
extern volatile uint32_t        _APPOCLR __attribute__((section("sfrs"),address(0xBF880184)));
extern volatile uint32_t        _APPOSET __attribute__((section("sfrs"),address(0xBF880188)));
extern volatile uint32_t        _APPOINV __attribute__((section("sfrs"),address(0xBF88018C)));
#define _APPI _APPI
extern volatile uint32_t   _APPI __attribute__((section("sfrs"), address(0xBF880190)));
#define INTCON INTCON
extern volatile uint32_t   INTCON __attribute__((section("sfrs"), address(0xBF881000)));
typedef struct {
  uint32_t INT0EP:1;
  uint32_t INT1EP:1;
  uint32_t INT2EP:1;
  uint32_t INT3EP:1;
  uint32_t INT4EP:1;
  uint32_t :3;
  uint32_t TPC:3;
  uint32_t :1;
  uint32_t MVEC:1;
  uint32_t :3;
  uint32_t SS0:1;
} __INTCONbits_t;
extern volatile __INTCONbits_t INTCONbits __asm__ ("INTCON") __attribute__((section("sfrs"), address(0xBF881000)));
extern volatile uint32_t        INTCONCLR __attribute__((section("sfrs"),address(0xBF881004)));
extern volatile uint32_t        INTCONSET __attribute__((section("sfrs"),address(0xBF881008)));
extern volatile uint32_t        INTCONINV __attribute__((section("sfrs"),address(0xBF88100C)));
#define INTSTAT INTSTAT
extern volatile uint32_t   INTSTAT __attribute__((section("sfrs"), address(0xBF881010)));
typedef union {
  struct {
    uint32_t VEC:6;
    uint32_t :2;
    uint32_t RIPL:3;
  };
  struct {
    uint32_t :8;
    uint32_t SRIPL:3;
  };
} __INTSTATbits_t;
extern volatile __INTSTATbits_t INTSTATbits __asm__ ("INTSTAT") __attribute__((section("sfrs"), address(0xBF881010)));
#define IPTMR IPTMR
extern volatile uint32_t   IPTMR __attribute__((section("sfrs"), address(0xBF881020)));
extern volatile uint32_t        IPTMRCLR __attribute__((section("sfrs"),address(0xBF881024)));
extern volatile uint32_t        IPTMRSET __attribute__((section("sfrs"),address(0xBF881028)));
extern volatile uint32_t        IPTMRINV __attribute__((section("sfrs"),address(0xBF88102C)));
#define IFS0 IFS0
extern volatile uint32_t   IFS0 __attribute__((section("sfrs"), address(0xBF881030)));
typedef struct {
  uint32_t CTIF:1;
  uint32_t CS0IF:1;
  uint32_t CS1IF:1;
  uint32_t INT0IF:1;
  uint32_t T1IF:1;
  uint32_t IC1IF:1;
  uint32_t OC1IF:1;
  uint32_t INT1IF:1;
  uint32_t T2IF:1;
  uint32_t IC2IF:1;
  uint32_t OC2IF:1;
  uint32_t INT2IF:1;
  uint32_t T3IF:1;
  uint32_t IC3IF:1;
  uint32_t OC3IF:1;
  uint32_t INT3IF:1;
  uint32_t T4IF:1;
  uint32_t IC4IF:1;
  uint32_t OC4IF:1;
  uint32_t INT4IF:1;
  uint32_t T5IF:1;
  uint32_t IC5IF:1;
  uint32_t OC5IF:1;
  uint32_t SPI1EIF:1;
  uint32_t SPI1TXIF:1;
  uint32_t SPI1RXIF:1;
  uint32_t U1EIF:1;
  uint32_t U1RXIF:1;
  uint32_t U1TXIF:1;
  uint32_t I2C1BIF:1;
  uint32_t I2C1SIF:1;
  uint32_t I2C1MIF:1;
} __IFS0bits_t;
extern volatile __IFS0bits_t IFS0bits __asm__ ("IFS0") __attribute__((section("sfrs"), address(0xBF881030)));
extern volatile uint32_t        IFS0CLR __attribute__((section("sfrs"),address(0xBF881034)));
extern volatile uint32_t        IFS0SET __attribute__((section("sfrs"),address(0xBF881038)));
extern volatile uint32_t        IFS0INV __attribute__((section("sfrs"),address(0xBF88103C)));
#define IFS1 IFS1
extern volatile uint32_t   IFS1 __attribute__((section("sfrs"), address(0xBF881040)));
typedef struct {
  uint32_t CNIF:1;
  uint32_t AD1IF:1;
  uint32_t PMPIF:1;
  uint32_t CMP1IF:1;
  uint32_t CMP2IF:1;
  uint32_t SPI2EIF:1;
  uint32_t SPI2TXIF:1;
  uint32_t SPI2RXIF:1;
  uint32_t U2EIF:1;
  uint32_t U2RXIF:1;
  uint32_t U2TXIF:1;
  uint32_t I2C2BIF:1;
  uint32_t I2C2SIF:1;
  uint32_t I2C2MIF:1;
  uint32_t FSCMIF:1;
  uint32_t RTCCIF:1;
  uint32_t :8;
  uint32_t FCEIF:1;
} __IFS1bits_t;
extern volatile __IFS1bits_t IFS1bits __asm__ ("IFS1") __attribute__((section("sfrs"), address(0xBF881040)));
extern volatile uint32_t        IFS1CLR __attribute__((section("sfrs"),address(0xBF881044)));
extern volatile uint32_t        IFS1SET __attribute__((section("sfrs"),address(0xBF881048)));
extern volatile uint32_t        IFS1INV __attribute__((section("sfrs"),address(0xBF88104C)));
#define IEC0 IEC0
extern volatile uint32_t   IEC0 __attribute__((section("sfrs"), address(0xBF881060)));
typedef struct {
  uint32_t CTIE:1;
  uint32_t CS0IE:1;
  uint32_t CS1IE:1;
  uint32_t INT0IE:1;
  uint32_t T1IE:1;
  uint32_t IC1IE:1;
  uint32_t OC1IE:1;
  uint32_t INT1IE:1;
  uint32_t T2IE:1;
  uint32_t IC2IE:1;
  uint32_t OC2IE:1;
  uint32_t INT2IE:1;
  uint32_t T3IE:1;
  uint32_t IC3IE:1;
  uint32_t OC3IE:1;
  uint32_t INT3IE:1;
  uint32_t T4IE:1;
  uint32_t IC4IE:1;
  uint32_t OC4IE:1;
  uint32_t INT4IE:1;
  uint32_t T5IE:1;
  uint32_t IC5IE:1;
  uint32_t OC5IE:1;
  uint32_t SPI1EIE:1;
  uint32_t SPI1TXIE:1;
  uint32_t SPI1RXIE:1;
  uint32_t U1EIE:1;
  uint32_t U1RXIE:1;
  uint32_t U1TXIE:1;
  uint32_t I2C1BIE:1;
  uint32_t I2C1SIE:1;
  uint32_t I2C1MIE:1;
} __IEC0bits_t;
extern volatile __IEC0bits_t IEC0bits __asm__ ("IEC0") __attribute__((section("sfrs"), address(0xBF881060)));
extern volatile uint32_t        IEC0CLR __attribute__((section("sfrs"),address(0xBF881064)));
extern volatile uint32_t        IEC0SET __attribute__((section("sfrs"),address(0xBF881068)));
extern volatile uint32_t        IEC0INV __attribute__((section("sfrs"),address(0xBF88106C)));
#define IEC1 IEC1
extern volatile uint32_t   IEC1 __attribute__((section("sfrs"), address(0xBF881070)));
typedef struct {
  uint32_t CNIE:1;
  uint32_t AD1IE:1;
  uint32_t PMPIE:1;
  uint32_t CMP1IE:1;
  uint32_t CMP2IE:1;
  uint32_t SPI2EIE:1;
  uint32_t SPI2TXIE:1;
  uint32_t SPI2RXIE:1;
  uint32_t U2EIE:1;
  uint32_t U2RXIE:1;
  uint32_t U2TXIE:1;
  uint32_t I2C2BIE:1;
  uint32_t I2C2SIE:1;
  uint32_t I2C2MIE:1;
  uint32_t FSCMIE:1;
  uint32_t RTCCIE:1;
  uint32_t :8;
  uint32_t FCEIE:1;
} __IEC1bits_t;
extern volatile __IEC1bits_t IEC1bits __asm__ ("IEC1") __attribute__((section("sfrs"), address(0xBF881070)));
extern volatile uint32_t        IEC1CLR __attribute__((section("sfrs"),address(0xBF881074)));
extern volatile uint32_t        IEC1SET __attribute__((section("sfrs"),address(0xBF881078)));
extern volatile uint32_t        IEC1INV __attribute__((section("sfrs"),address(0xBF88107C)));
#define IPC0 IPC0
extern volatile uint32_t   IPC0 __attribute__((section("sfrs"), address(0xBF881090)));
typedef struct {
  uint32_t CTIS:2;
  uint32_t CTIP:3;
  uint32_t :3;
  uint32_t CS0IS:2;
  uint32_t CS0IP:3;
  uint32_t :3;
  uint32_t CS1IS:2;
  uint32_t CS1IP:3;
  uint32_t :3;
  uint32_t INT0IS:2;
  uint32_t INT0IP:3;
} __IPC0bits_t;
extern volatile __IPC0bits_t IPC0bits __asm__ ("IPC0") __attribute__((section("sfrs"), address(0xBF881090)));
extern volatile uint32_t        IPC0CLR __attribute__((section("sfrs"),address(0xBF881094)));
extern volatile uint32_t        IPC0SET __attribute__((section("sfrs"),address(0xBF881098)));
extern volatile uint32_t        IPC0INV __attribute__((section("sfrs"),address(0xBF88109C)));
#define IPC1 IPC1
extern volatile uint32_t   IPC1 __attribute__((section("sfrs"), address(0xBF8810A0)));
typedef struct {
  uint32_t T1IS:2;
  uint32_t T1IP:3;
  uint32_t :3;
  uint32_t IC1IS:2;
  uint32_t IC1IP:3;
  uint32_t :3;
  uint32_t OC1IS:2;
  uint32_t OC1IP:3;
  uint32_t :3;
  uint32_t INT1IS:2;
  uint32_t INT1IP:3;
} __IPC1bits_t;
extern volatile __IPC1bits_t IPC1bits __asm__ ("IPC1") __attribute__((section("sfrs"), address(0xBF8810A0)));
extern volatile uint32_t        IPC1CLR __attribute__((section("sfrs"),address(0xBF8810A4)));
extern volatile uint32_t        IPC1SET __attribute__((section("sfrs"),address(0xBF8810A8)));
extern volatile uint32_t        IPC1INV __attribute__((section("sfrs"),address(0xBF8810AC)));
#define IPC2 IPC2
extern volatile uint32_t   IPC2 __attribute__((section("sfrs"), address(0xBF8810B0)));
typedef struct {
  uint32_t T2IS:2;
  uint32_t T2IP:3;
  uint32_t :3;
  uint32_t IC2IS:2;
  uint32_t IC2IP:3;
  uint32_t :3;
  uint32_t OC2IS:2;
  uint32_t OC2IP:3;
  uint32_t :3;
  uint32_t INT2IS:2;
  uint32_t INT2IP:3;
} __IPC2bits_t;
extern volatile __IPC2bits_t IPC2bits __asm__ ("IPC2") __attribute__((section("sfrs"), address(0xBF8810B0)));
extern volatile uint32_t        IPC2CLR __attribute__((section("sfrs"),address(0xBF8810B4)));
extern volatile uint32_t        IPC2SET __attribute__((section("sfrs"),address(0xBF8810B8)));
extern volatile uint32_t        IPC2INV __attribute__((section("sfrs"),address(0xBF8810BC)));
#define IPC3 IPC3
extern volatile uint32_t   IPC3 __attribute__((section("sfrs"), address(0xBF8810C0)));
typedef struct {
  uint32_t T3IS:2;
  uint32_t T3IP:3;
  uint32_t :3;
  uint32_t IC3IS:2;
  uint32_t IC3IP:3;
  uint32_t :3;
  uint32_t OC3IS:2;
  uint32_t OC3IP:3;
  uint32_t :3;
  uint32_t INT3IS:2;
  uint32_t INT3IP:3;
} __IPC3bits_t;
